# Pandas

### To day we do exploratory data analysis.

link of dataSet => https://www.kaggle.com/datasets/kaggle/sf-salaries

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('SF_Salaries/Salaries.csv')

df.head()

/tmp/ipykernel_7482/3756909773.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('SF_Salaries/Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Use the info() method to find out how many entries there are.**

- info() -> give me Dtype for every column
- **most important** -> if any column have a less number entries, than main one | shoud know there are **missing data**

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

from info, function i get :

- the column of -> BasePay , Benefits <- both have missing data

**describe() function -> give you descriptin about your data /or/ (descriptive)**

In [4]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [5]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

## Starting the part of Q/A:

1) **what is the aerage(mean) BasePay.**

- as we know, BasePay, have a missing data
- **first clean it.**

In [6]:

# i used sum with isnull -> to get the count of how mouch nulls values i have.
df['BasePay'].isnull().sum()

np.int64(605)

In [7]:
df.shape

(148654, 13)

In [8]:
df = df[df['BasePay'].notnull()]

In [9]:
df['BasePay'].isnull().sum()

np.int64(0)

In [10]:
df.shape

(148049, 13)

In [11]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [12]:
# convert it to float

# df['BasePay'].astype(float)   => could not convert string to float: 'Not Provided'

df=df.loc[df['BasePay'] != 'Not Provided']

In [13]:
df['BasePay']=df['BasePay'].astype(float)

df['BasePay'].mean()

np.float64(66325.44884048768)

-..................................

2) **what is the highest amount of OverTimePay in dataSert**

In [14]:
df['OvertimePay']=df['OvertimePay'].astype(float)

In [15]:
df['OvertimePay'].max()

np.float64(245131.88)

In [16]:

# i select all the row which have that value.

df.loc[df['OvertimePay'] == 245131.88]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

-...............................

3) **what is the jop title of JOSEPH DRISCOLL**

In [17]:
df.loc[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

-..........................................

4) **what is the name of highest paid person(include benefits)?**

In [18]:
df.loc[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [19]:
# loest one 

df.loc[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['EmployeeName']

df.loc[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [20]:
df['BasePay'].info()

<class 'pandas.core.series.Series'>
Index: 148045 entries, 0 to 148653
Series name: BasePay
Non-Null Count   Dtype
--------------   -----
148045 non-null  float64
dtypes: float64(1)
memory usage: 2.3 MB

In [21]:
df = df.loc[df['BasePay'].notnull()]

In [22]:
df['BasePay'] = df['BasePay'].astype(float)

In [23]:
dg = df.groupby('Year').agg({'BasePay':['mean','max','min','var','std']})

In [24]:
dg

           BasePay
              mean        max     min           var           std
Year
2011  63595.956517  294580.02    0.00  1.644852e+09  40556.774993
2012  65436.406857  302578.00 -166.01  1.745753e+09  41782.209797
2013  69630.030216  319275.01   15.83  1.956922e+09  44237.113207
2014  66564.421924  318835.49    0.00  1.940736e+09  44053.783972

how many unique jops are there.

In [25]:
df['JobTitle'].nunique()

2154

what are the most top 5 comman jobs?

In [26]:
df['JobTitle'].value_counts().head()

JobTitle
Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: count, dtype: int64

6) **How many jop title were represented by only one person in 2013**

In [38]:
(df.loc[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

np.int64(202)

# The End!.üëç